dvhai08/ampm_smartlight/firmware/VT_SMARTLIGHT_STM32F4_LWIP_V2/ampm_lib/ampm_gsm/ampm_gsm_sms.c
/**********************************************************************
Name: Hai Nguyen Van
Cellphone: (84) 97-8779-222
Mail:thienhaiblue@ampm.com.vn 
----------------------------------
AMPM ELECTRONICS EQUIPMENT TRADING COMPANY LIMITED.,
Add: 143/36/10 , Lien khu 5-6 street, Binh Hung Hoa B Ward, Binh Tan District , HCM City,Vietnam

*********************************************************************/
#include "ampm_gsm_common.h"
#include "ampm_gsm_sms.h"
#include "lib/ampm_list.h"
#include "sms/pdu.h"
#include "at_command_parser.h"


#define INFO(...)	//PrintfDebug(__VA_ARGS__)

#define smsScanf	sscanf

#ifdef CMSIS_OS_RTX
osMutexId ampmGsmSmsMutexId;
osMutexDef(ampmGsmSmsMutex);
#endif

uint32_t Ampm_GetServiceCenterNumber(uint16_t cnt,uint8_t c);

LIST(smsList);

Timeout_Type tSmsTaskTimeOut;
struct SMS_LIST_TYPE *smsMsg;

uint8_t smsNewMessageFlag = 0;
uint8_t smsUnreadBuff[32] = {0};
RINGBUF smsUnreadRingBuff;

uint8_t smsSender[16];
uint8_t smsDataBuf[256];
uint8_t pdu_len_except_smsc;
int16_t pdu_len;

void (*Ampm_SmsRecvCallback)(uint8_t *buf);

uint8_t smsCancelAll = 0;
uint8_t flagSmsReadFinish = 0;
uint8_t serviceCenterNumber[16];
uint8_t getServiceCenterNumber = 0;
uint8_t smsTaskFailCnt = 0;
uint8_t readTryCnt = 0;
uint16_t smsIndex = 0;



uint8_t Ampm_SmsAddMsg(struct SMS_LIST_TYPE *msg);
uint8_t Ampm_GsmSmsRecvCallback_CCLK(uint8_t *buf);
uint8_t Ampm_GsmSmsRecvCallback_CMGR(uint8_t *buf);
uint8_t Ampm_GsmSmsRecvCallback_CMGD(uint8_t *buf);
uint8_t Ampm_GsmSmsRecv0(AMPM_CMD_PHASE_TYPE phase);
uint8_t Ampm_GsmSmsRecv1(AMPM_CMD_PHASE_TYPE phase);
uint8_t Ampm_GsmSmsRecv2(AMPM_CMD_PHASE_TYPE phase);
uint8_t Ampm_GsmSmsRecv3(AMPM_CMD_PHASE_TYPE phase);

uint8_t Ampm_GsmSmsSendCallback_PreCMGS(uint8_t *buf);
uint8_t Ampm_GsmSmsSendCallback_CMGF(AMPM_CMD_PHASE_TYPE phase);
uint8_t Ampm_GsmSmsSendCallback_CSCA(AMPM_CMD_PHASE_TYPE phase);
uint8_t Ampm_GsmSmsSendMessageCallback(uint8_t *buf);
uint8_t Ampm_GsmSmsSendCallback_CMGS(uint8_t *buf);
uint8_t Ampm_GsmSmsSent(AMPM_CMD_PHASE_TYPE phase);
uint8_t Ampm_GsmCREG(AMPM_CMD_PHASE_TYPE phase);
uint8_t Ampm_GsmSmsSendCallback_CheckAT_OK(AMPM_CMD_PHASE_TYPE phase);
uint8_t Ampm_GsmSmsRecvCallback_CheckAT_OK(AMPM_CMD_PHASE_TYPE phase);
uint8_t smsTryCnt = 0;
extern const AMPM_GSM_AT_CMD_PACKET_TYPE smsRecvCmd_Read_AT_CCLK;
extern const AMPM_GSM_AT_CMD_PACKET_TYPE sendCmd_AT_CGSN;

const AMPM_GSM_AT_CMD_PACKET_TYPE smsSevdCmd_Set_AT_CCLK = {NULL,Ampm_GsmSmsRecvCallback_CCLK,NULL,NULL,"OK","ERROR"};//delay = 500,timeout = 3000,retry = 1

const AMPM_GSM_AT_CMD_PACKET_TYPE smsRecvCmd_AT_CMGR = {NULL,Ampm_GsmSmsRecvCallback_CMGR,NULL,NULL,"OK","ERROR"};//delay = 500,timeout = 3000,retry = 1

const AMPM_GSM_AT_CMD_PACKET_TYPE smsRecvCmd_AT_CMGD = {NULL,Ampm_GsmSmsRecvCallback_CMGD,NULL,NULL,"OK","ERROR"};//delay = 500,timeout = 3000,retry = 1

const AMPM_CMD_PROCESS_TYPE smsRecvCmdProcess_end	= {
		NULL,(void *)&ampmAtCmd_AT,Ampm_GsmSendCallback,Ampm_GsmRecvCallback,NULL,1,1000,100};

const AMPM_CMD_PROCESS_TYPE smsRecvCmdProcess_5	= {
		NULL,(void *)&smsRecvCmd_AT_CMGD,Ampm_GsmSendCallback,Ampm_GsmRecvCallback,Ampm_GsmSmsRecv1,1,1000,100};

const AMPM_CMD_PROCESS_TYPE smsRecvCmdProcess_4	= {
		(void *)&smsRecvCmdProcess_5,(void *)&smsRecvCmd_AT_CMGR,Ampm_GsmSendCallback,Ampm_GsmRecvCallback,Ampm_GsmSmsRecv2,1,1000,100};

const AMPM_CMD_PROCESS_TYPE smsRecvCmdProcess_3	= {
		(void *)&smsRecvCmdProcess_4,(void *)&ampmAtCmd_AT_CMGL,Ampm_GsmSendCallback,Ampm_GsmRecvCallback,Ampm_GsmSmsRecv1,1,1000,1000};

const AMPM_CMD_PROCESS_TYPE smsRecvCmdProcess_2	= {
		(void *)&smsRecvCmdProcess_3,(void *)&ampmAtCmd_AT_CMGF_1,Ampm_GsmSendCallback,Ampm_GsmRecvCallback,Ampm_GsmSmsRecv0,1,1000,100};

const AMPM_CMD_PROCESS_TYPE smsRecvCmdProcess_1	= {
		(void *)&smsRecvCmdProcess_2,(void *)&ampmAtCmd_AT_CLIP,Ampm_GsmSendCallback,Ampm_GsmRecvCallback,NULL,1,1000,100};

const AMPM_CMD_PROCESS_TYPE smsRecvCmdProcess_03	= {
		(void *)&smsRecvCmdProcess_1,(void *)&ampmAtCmd_AT_CSCS_GSM,Ampm_GsmSendCallback,Ampm_GsmRecvCallback,NULL,1,3000,100};
		
const AMPM_CMD_PROCESS_TYPE smsRecvCmdProcess_02	= {
		(void *)&smsRecvCmdProcess_03,(void *)&sendCmd_AT_CGSN,Ampm_GsmSendCallback,Ampm_GsmRecvCallback,NULL,1,3000,100};
	
const AMPM_CMD_PROCESS_TYPE smsRecvCmdProcess_01	= {
		(void *)&smsRecvCmdProcess_02,(void *)&smsRecvCmd_Read_AT_CCLK,Ampm_GsmSendCallback,Ampm_GsmRecvCallback,NULL,1,3000,100};

const AMPM_CMD_PROCESS_TYPE smsRecvCmdProcess_001	= {
		(void *)&smsRecvCmdProcess_02,(void *)&smsSevdCmd_Set_AT_CCLK,Ampm_GsmSendCallback,Ampm_GsmRecvCallback,NULL,1,3000,100};

const AMPM_CMD_PROCESS_TYPE smsRecvCmdProcess_0	= {
		(void *)&smsRecvCmdProcess_01,(void *)&ampmAtCmd_AT_CSQ,Ampm_GsmSendCallback,Ampm_GsmRecvCallback,Ampm_GsmSmsRecv3,1,1000,100};

const AMPM_CMD_PROCESS_TYPE smsRecvCmdProcess_00	= {
		(void *)&smsRecvCmdProcess_0,(void *)&ampmAtCmd_AT_CEND,Ampm_GsmSendCallback,Ampm_GsmRecvCallback,NULL,1,1000,100};

const AMPM_CMD_PROCESS_TYPE smsRecvCmdProcess_Start1	= {
		(void *)&smsRecvCmdProcess_00,(void *)&ampmAtCmd_GotoCmdMode,Ampm_GsmSendCallback,Ampm_GsmRecvCallback,NULL,1,1000,100};

const AMPM_CMD_PROCESS_TYPE smsRecvCmdProcess_Start	= {
		(void *)&smsRecvCmdProcess_00,(void *)&ampmAtCmd_AT,Ampm_GsmSendCallback,Ampm_GsmRecvCallback,Ampm_GsmSmsRecvCallback_CheckAT_OK,1,1000,100};


//send SMS
const AMPM_GSM_AT_CMD_PACKET_TYPE smsSendCmd_AT_CSCA = {"AT+CSCA?\r",NULL,"+CSCA: \"",Ampm_GetServiceCenterNumber,"OK","ERROR"};//delay = 500,timeout = 3000,retry = 1
const AMPM_GSM_AT_CMD_PACKET_TYPE smsSendCmd_AT_CMGS = {NULL,Ampm_GsmSmsSendCallback_CMGS,NULL,NULL,"\r\r\n>","ERROR"};//delay = 500,timeout = 3000,retry = 1
const AMPM_GSM_AT_CMD_PACKET_TYPE smsSendMessage = {NULL,Ampm_GsmSmsSendMessageCallback,NULL,NULL,"+CMGS:","ERROR"};//delay = 500,timeout = 3000,retry = 1

const AMPM_CMD_PROCESS_TYPE smsSendCmdProcess_end	= {
		NULL,(void *)&ampmAtCmd_AT,Ampm_GsmSendCallback,Ampm_GsmRecvCallback,NULL,1,1000,100};

const AMPM_CMD_PROCESS_TYPE smsSendCmdProcess_6	= {
		NULL,(void *)&ampmAtCmd_AT_CREG,Ampm_GsmSendCallback,Ampm_GsmRecvCallback,Ampm_GsmCREG,1,3000,100};

const AMPM_CMD_PROCESS_TYPE smsSendCmdProcess_5	= {
		(void *)&smsSendCmdProcess_end,(void *)&smsSendMessage,Ampm_GsmSendCallback,Ampm_GsmRecvCallback,Ampm_GsmSmsSent,0,30000,100};

const AMPM_CMD_PROCESS_TYPE smsSendCmdProcess_4	= {
		(void *)&smsSendCmdProcess_5,(void *)&smsSendCmd_AT_CMGS,Ampm_GsmSendCallback,Ampm_GsmRecvCallback,NULL,0,10000,500};

const AMPM_CMD_PROCESS_TYPE smsSendCmdProcess_3	= {
		(void *)&smsSendCmdProcess_4,(void *)&smsSendCmd_AT_CSCA,Ampm_GsmSendCallback,Ampm_GsmRecvCallback,NULL,1,5000,500};

