dvhai08/ampm_smartlight/firmware/VT_SMARTLIGHT_STM32F4_LWIP_V2/ampm_lib/ampm_gsm/ampm_gsm_sms.c
const AMPM_CMD_PROCESS_TYPE smsSendCmdProcess_CSCS	= {
		(void *)&smsSendCmdProcess_3,(void *)&ampmAtCmd_AT_CSCS_GSM,Ampm_GsmSendCallback,Ampm_GsmRecvCallback,NULL,1,3000,100};
		
const AMPM_CMD_PROCESS_TYPE smsSendCmdProcess_2	= {
		(void *)&smsSendCmdProcess_CSCS,(void *)&ampmAtCmd_AT_CMGF_0,Ampm_GsmSendCallback,Ampm_GsmRecvCallback,Ampm_GsmSmsSendCallback_CSCA,1,1000,100};

const AMPM_CMD_PROCESS_TYPE smsSendCmdProcess_1	= {
		(void *)&smsSendCmdProcess_4,(void *)&ampmAtCmd_AT_CMGF_1,Ampm_GsmSendCallback,Ampm_GsmRecvCallback,Ampm_GsmSmsSendCallback_CSCA,1,1000,100};

const AMPM_CMD_PROCESS_TYPE smsSendCmdProcess_0	= {
		(void *)&smsSendCmdProcess_1,(void *)&ampmAtCmd_AT,Ampm_GsmSendCallback,Ampm_GsmRecvCallback,Ampm_GsmSmsSendCallback_CMGF,1,1000,100};

const AMPM_CMD_PROCESS_TYPE smsSendCmdProcess_0_0	= {
		(void *)&smsSendCmdProcess_0,(void *)&ampmAtCmd_GotoCmdMode,Ampm_GsmSendCallback,Ampm_GsmRecvCallback,NULL,1,1000,100};

const AMPM_CMD_PROCESS_TYPE smsSendCmdProcess_Start	= {
		(void *)&smsSendCmdProcess_0,(void *)&ampmAtCmd_AT,Ampm_GsmSendCallback,Ampm_GsmRecvCallback,NULL,1,1000,100};


uint8_t Ampm_GsmSmsRecvCallback_CheckAT_OK(AMPM_CMD_PHASE_TYPE phase)
{
	if(phase ==  AMPM_CMD_OK)
	{
		Ampm_SendAtCmdNow(&smsRecvCmdProcess_00);
	}
	else
	{
		Ampm_SendAtCmdNow(&smsRecvCmdProcess_Start1);
	}
	return 1;
}

uint8_t Ampm_GsmSmsSendCallback_CheckAT_OK(AMPM_CMD_PHASE_TYPE phase)
{
	if(phase ==  AMPM_CMD_OK)
	{
		Ampm_SendAtCmdNow(&smsSendCmdProcess_1);
	}
	else
	{
		Ampm_SendAtCmdNow(&smsSendCmdProcess_0);
	}
	return 1;
}

uint8_t Ampm_GsmSmsSendCallback_CMGF(AMPM_CMD_PHASE_TYPE phase)
{
	if(smsMsg->mode == SMS_TEXT_MODE)
	{
		Ampm_SendAtCmdNow(&smsSendCmdProcess_1);
	}
	else
	{
		Ampm_SendAtCmdNow(&smsSendCmdProcess_2);
	}
	return 1;
}

uint8_t Ampm_GsmSmsSendCallback_CSCA(AMPM_CMD_PHASE_TYPE phase)
{
	if(smsMsg->msg != NULL && smsMsg->phone != NULL)
	{
		if(smsMsg->mode != SMS_TEXT_MODE)
		{
			getServiceCenterNumber = 0;
			Ampm_SendAtCmdNow(&smsSendCmdProcess_3);
		}
	}
	else
	{
		Ampm_SendAtCmdNow(&smsSendCmdProcess_end);
	}
	return 1;
}

void Ampm_UpdateStatus(uint8_t *status,uint8_t value)
{
	#ifdef CMSIS_OS_RTX
	if(osMutexWait(ampmGsmSmsMutexId, 1000) == osOK)
	{
		//AMPM_GSM_LIB_DBG("AMPM_SMS_MSG:Ampm_UpdateStatus->OK\r\n");
		#endif
		if(status)
		{
			if(value == 0xff)
					ampm_free(status);
			else
				*status = value;
		}
		#ifdef CMSIS_OS_RTX
		osMutexRelease(ampmGsmSmsMutexId);
	}
	#endif
}

uint8_t Ampm_GsmSmsSent(AMPM_CMD_PHASE_TYPE phase)
{
	if(phase == AMPM_CMD_OK)
	{
		smsMsg->phone = NULL;
		smsMsg->len = 0;
		smsMsg->flag = SMS_MSG_SENT;
		Ampm_SendAtCmdNow(&smsSendCmdProcess_end);
		smsTaskFailCnt = 0;
	}
	else
	{
		COMM_Putc(0x1B);
		smsTaskFailCnt++;
		Ampm_SendAtCmdNow(&smsSendCmdProcess_6);
	}
	return 1;
}

uint8_t Ampm_GsmCREG(AMPM_CMD_PHASE_TYPE phase)
{
	if(phase == AMPM_CMD_ERROR)
	{
		INFO("Ampm_GsmCREG->ERROR\r\n");
		smsTaskFailCnt++;
	}
	else
	{
		smsTaskFailCnt = 0;
	}
	INFO("smsTaskFailCnt=%d\r\n",smsTaskFailCnt);
	return 1;
}

uint8_t Ampm_GsmSmsSendMessageCallback(uint8_t *buf)
{
	uint16_t i;
	if(smsMsg->mode == SMS_TEXT_MODE)
	{
		ampm_sprintf((char *)buf,"%s%c",smsMsg->msg,0x1A/*Send Ctl-Z*/);
	}
	else
	{
		for (i = 0; i < pdu_len; ++i) 
		{	
			ampm_sprintf((char *)&buf[i*2], "%02X", smsDataBuf[i]);
		}
		buf[i*2] = 0x1A;// Send Ctl-Z
		buf[i*2 + 1] = 0;
	}
	return 1;
}

uint8_t Ampm_GsmSmsSendCallback_CMGS(uint8_t *buf)
{
	uint8_t res = 0;
	if((smsMsg->msg[0] != NULL || smsMsg->mode != SMS_TEXT_MODE) && smsMsg->phone[0] != NULL)
	{
		if(smsMsg->mode == SMS_TEXT_MODE)
		{
			res = ampm_sprintf((char *)buf,"AT+CMGS=\"%s\"\r",smsMsg->phone);
		}
		else
		{
			if(getServiceCenterNumber && serviceCenterNumber[0] != NULL)
			{
				if(smsMsg->mode == SMS_PDU16_MODE)
					pdu_len = pdu16_encode((const char *)serviceCenterNumber,(const char *)smsMsg->phone,( uint16_t *)smsMsg->msg,smsMsg->len,smsDataBuf,sizeof(smsDataBuf));
				else
					pdu_len = pdu_encode((const char *)serviceCenterNumber,(const char *)smsMsg->phone,(const char*)smsMsg->msg,smsDataBuf,sizeof(smsDataBuf));
				if(pdu_len < 0) //"error encoding to PDU"
				{
					smsMsg->phone = NULL;
					smsMsg->len = 0;
					smsMsg->flag = SMS_MSG_FAIL;
					smsTaskFailCnt++;
					Ampm_SendAtCmdNow(&smsSendCmdProcess_end);
					return 0;
				}
				pdu_len_except_smsc = pdu_len - 1 - smsDataBuf[0];
				res =  ampm_sprintf((char *)buf,"AT+CMGS=%d\r",pdu_len_except_smsc);
			}
			else
			{
				Ampm_SendAtCmdNow(&smsSendCmdProcess_Start);
			}
		}
		//Ampm_SendAtCmdNow(&smsSendCmdProcess_4);
		return res;
	}
	else
	{
		smsMsg->phone = NULL;
		smsMsg->len = 0;
		smsMsg->flag = SMS_MSG_SENT;
		Ampm_SendAtCmdNow(&smsSendCmdProcess_end);
		smsTaskFailCnt++;
	}
	return 0;
}

#include "stm32f4xx_hal.h"
extern RTC_HandleTypeDef hrtc;
uint8_t Ampm_GsmSmsRecvCallback_CCLK(uint8_t *buf)
{
	RTC_DateTypeDef sdatestructureget;
  RTC_TimeTypeDef stimestructureget;

  /* Get the RTC current Time */
  HAL_RTC_GetTime(&hrtc, &stimestructureget, RTC_FORMAT_BIN);
  /* Get the RTC current Date */
  HAL_RTC_GetDate(&hrtc, &sdatestructureget, RTC_FORMAT_BIN);
	sysGsmTime.year = 2000 + sdatestructureget.Year;
	sysGsmTime.mday = sdatestructureget.Date;
	sysGsmTime.month = sdatestructureget.Month;
	sysGsmTime.hour = stimestructureget.Hours;
	sysGsmTime.min = stimestructureget.Minutes;
	sysGsmTime.sec = stimestructureget.Seconds;
	return (uint8_t )ampm_sprintf((char *)buf,"AT+CCLK=\"%02d/%02d/%02d,%02d:%02d:%02d+28\"\r",sysGsmTime.year,sysGsmTime.month,sysGsmTime.mday,sysGsmTime.hour,sysGsmTime.min,sysGsmTime.sec);
}

uint8_t Ampm_GsmSmsRecvCallback_CMGR(uint8_t *buf)
{
	InitTimeout(&tSmsTaskTimeOut, SYSTICK_TIME_SEC(3));
	return (uint8_t )ampm_sprintf((char *)buf,"AT+CMGR=%d\r",smsIndex);
}

uint8_t Ampm_GsmSmsRecvCallback_CMGD(uint8_t *buf)
{
	return (uint8_t )ampm_sprintf((char *)buf,"AT+CMGD=%d\r",smsIndex);
}

uint8_t Ampm_GsmSmsRecv0(AMPM_CMD_PHASE_TYPE phase)
{
	uint8_t c;
	static uint8_t errorTimes = 0;
	/*send:  NULL,Ampm_GsmSmsRecvCallback0,NULL,NULL,"OK","ERROR",//delay = 500,timeout = 3000,retry = 1*/
	if(RINGBUF_GetFill(&smsUnreadRingBuff) & 0x01 == 0)
	{
		while(RINGBUF_Get(&smsUnreadRingBuff,&c) == 0);
		Ampm_SendAtCmdNow(&smsRecvCmdProcess_3);
		errorTimes++;
	}
	else if(RINGBUF_GetFill(&smsUnreadRingBuff) >=2)
	{
		RINGBUF_Get(&smsUnreadRingBuff,&c);
		smsIndex = c;
		RINGBUF_Get(&smsUnreadRingBuff,&c);
		smsIndex |= (((uint16_t)c) << 8 & 0xff00);
		if(smsIndex >= 1000)
		{
			while(RINGBUF_Get(&smsUnreadRingBuff,&c) == 0);
			Ampm_SendAtCmdNow(&smsRecvCmdProcess_3);
			errorTimes++;
		}
		else
		{
			readTryCnt = 3;
			errorTimes = 0;
			Ampm_SendAtCmdNow(&smsRecvCmdProcess_4);
		}
	}
	else
	{
		RINGBUF_Get(&smsUnreadRingBuff,&c);
		RINGBUF_Get(&smsUnreadRingBuff,&c);
		Ampm_SendAtCmdNow(&smsRecvCmdProcess_3);
	}
	if(errorTimes >= 3)
	{
		errorTimes = 0;
		smsTaskFailCnt = SMS_MAX_RETRY;
	}
	return 1;
}

