dvhai08/ampm_smartlight/firmware/VT_SMARTLIGHT_STM32F4_LWIP_V2/ampm_lib/ampm_gsm/ampm_gsm_sms.c
uint8_t Ampm_GsmSmsRecv1(AMPM_CMD_PHASE_TYPE phase)
{
	uint8_t c;
	/*send:  NULL,Ampm_GsmSmsRecvCallback0,NULL,NULL,"OK","ERROR",//delay = 500,timeout = 3000,retry = 1*/
	/*if(!Ampm_SmsCheckMessage_IsEmpty())
	{
		if(RINGBUF_GetFill(&smsUnreadRingBuff))
		{
			ampm_NewSmsFlag = 1;
			while(RINGBUF_Get(&smsUnreadRingBuff,&c) == 0);
		}
		Ampm_SendAtCmdNow(&smsRecvCmdProcess_end);
		return 1;
	}*/
	if(RINGBUF_GetFill(&smsUnreadRingBuff) >=2)
	{
		RINGBUF_Get(&smsUnreadRingBuff,&c);
		smsIndex = c;
		RINGBUF_Get(&smsUnreadRingBuff,&c);
		smsIndex |= (((uint16_t)c) << 8 & 0xff00);
		if(smsIndex >= 1000)
		{
			Ampm_SendAtCmdNow(&smsRecvCmdProcess_5);
		}
		else
		{
			readTryCnt = 3;
			Ampm_SendAtCmdNow(&smsRecvCmdProcess_4);
		}
	}
	else{
		RINGBUF_Get(&smsUnreadRingBuff,&c);
		RINGBUF_Get(&smsUnreadRingBuff,&c);
		Ampm_SendAtCmdNow(&smsRecvCmdProcess_end);
	}
	return 1;
}

uint8_t Ampm_GsmSmsRecv2(AMPM_CMD_PHASE_TYPE phase)
{
	if(flagSmsReadFinish || (CheckTimeout(&tSmsTaskTimeOut) == SYSTICK_TIMEOUT))
	{
		if(flagSmsReadFinish)
		{
			Ampm_SmsRecvCallback(smsDataBuf);
			Ampm_SendAtCmdNow(&smsRecvCmdProcess_5);
		}
		else
		{
			if(readTryCnt) 
			{
				readTryCnt--;
				COMM_Putc(0x1B);
				InitTimeout(&tSmsTaskTimeOut, SYSTICK_TIME_SEC(3));
				Ampm_SendAtCmdNow(&smsRecvCmdProcess_4);
			}
			else
			{
				Ampm_SendAtCmdNow(&smsRecvCmdProcess_5);
			}
		}
		return 1;
	}
	return 0;
}

extern uint8_t gsmGetTimeFlag;
uint8_t Ampm_GsmSmsRecv3(AMPM_CMD_PHASE_TYPE phase)
{
	if(gsmGetTimeFlag) 
	{
		gsmGetTimeFlag = 0;
		Ampm_SendAtCmdNow(&smsRecvCmdProcess_001);
	}
	else
	{
		Ampm_SendAtCmdNow(&smsRecvCmdProcess_01);
	}
	return 1;
}

uint8_t Ampm_StartRecvSms(void)
{
		return Ampm_SendAtCmd(&smsRecvCmdProcess_Start);
}

uint8_t Ampm_RecvSms_IsFinished(void)
{
	if(Ampm_SendAtCheck_IsEmpty() && Ampm_CmdTask_IsIdle(ampm_GSM_CmdPhase)){
		return 1;
	}
	return 0;
}


void Ampm_SmsTask_Init(void (*callback)(uint8_t *buf))
{
	Ampm_SmsRecvCallback = callback;
	list_init(smsList);
	getServiceCenterNumber = 0;
	RINGBUF_Init(&smsUnreadRingBuff,smsUnreadBuff,sizeof(smsUnreadBuff));
	#ifdef CMSIS_OS_RTX
	ampmGsmSmsMutexId = osMutexCreate(osMutex(ampmGsmSmsMutex));
	#endif
}

uint8_t Ampm_SmsTaskPeriodic_1Sec(void)
{
	uint8_t res = 0;
	struct SMS_LIST_TYPE *msg,*msgTemp = NULL;
	#ifdef CMSIS_OS_RTX
	if(osMutexWait(ampmGsmSmsMutexId, 1000) == osOK)
	{
	#endif
		//AMPM_GSM_LIB_DBG("AMPM_SMS_MSG:Ampm_SmsTaskPeriodic_1Sec->OK\r\n");
		if(list_length(smsList) == 0)
		{
			#ifdef CMSIS_OS_RTX
			osMutexRelease(ampmGsmSmsMutexId);
			#endif
			return 0;
		}
		msg = list_tail(smsList);
		while(msg != NULL)
		{
			if(msg->flag == SMS_NEW_MSG
				&& msg->msg != NULL 
				&& msg->phone != NULL 
				&& msg->len != 0
				&& msg->tryNum
			)
			{
				if(msg->timeout){ msg->timeout--;}
				else {res = 1;}
				msg = list_item_next(msg);
			}
			else
			{
				if(msg->callback)
				{
					msg->callback(msg);
				}
				if (msg->flag == SMS_MSG_SENT)
				{
					Ampm_UpdateStatus(msg->status,SMS_OK);
				}
				msgTemp = list_item_next(msg);
				list_remove(smsList,msg);
				if(msg->msg){ ampm_free(msg->msg);}
				if(msg) {ampm_free(msg);}
				if(msg)
				{
					AMPM_GSM_LIB_DBG("AMPM_SMS_MSG:HEAP_FREE******************\r\n");
				}
				msg = msgTemp;
			}
		}
	#ifdef CMSIS_OS_RTX
		osMutexRelease(ampmGsmSmsMutexId);
	}
	#endif
	return res;
}

uint32_t Ampm_SMS_IsInProcess(struct SMS_LIST_TYPE *my_msg)
{
	static struct SMS_LIST_TYPE *msg = NULL;
	if(list_length(smsList))
	{
		msg = list_head(smsList);
		while(msg != NULL)
		{
			if(msg == my_msg)
				return 1;
			msg = list_item_next(msg);
		}

	}
	return 0;
}

uint8_t Ampm_SmsTask(void)
{
	static uint8_t checkCnt  = 0;
	static struct SMS_LIST_TYPE *msg = NULL,*msgTemp = NULL;
	if(Ampm_SendAtCheck_IsEmpty() 
	&& Ampm_CmdTask_IsIdle(ampm_GSM_CmdPhase))
	{
			#ifdef CMSIS_OS_RTX
			if(osMutexWait(ampmGsmSmsMutexId, 1000) == osOK)
			{
				//AMPM_GSM_LIB_DBG("AMPM_SMS_MSG:Ampm_SmsTask->OK\r\n");
			#endif
			checkCnt++;
			if(checkCnt >= 10)
			{
				checkCnt = 0;
				#ifdef CMSIS_OS_RTX
				osMutexRelease(ampmGsmSmsMutexId);
				#endif
				return 1;
			}
			if(list_length(smsList))
			{
				msg = list_tail(smsList);
				while(msg != NULL)
				{
					checkCnt = 0;
					if(msg->mode == SMS_TEXT_MODE)
					{
						if(msg->msg[0] == 0){
							msg->len = 0;
						}
					}
					
					if(msg->flag == SMS_NEW_MSG
						&& msg->msg != NULL 
						&& msg->phone != NULL 
						&& msg->len != NULL
						&& msg->tryNum
					)
					{
						if(msg->timeout == 0)
						{
							msg->timeout = msg->timeoutReload;
							if(msg->tryNum){msg->tryNum--;}
							smsMsg = msg;
							Ampm_SendAtCmdNow(&smsSendCmdProcess_0);
						}
						else
						{
							msg = list_item_next(msg);
						}
					}
					else
					{
						if(msg->callback)
						{
							msg->callback(msg);
						}
						if (msg->flag == SMS_MSG_SENT)
						{
							Ampm_UpdateStatus(msg->status,SMS_OK);
						}
						msgTemp = list_item_next(msg);
						list_remove(smsList,msg);
						if(msg->msg){ ampm_free(msg->msg);}
						if(msg) {ampm_free(msg);}
						if(msg)
						{
							AMPM_GSM_LIB_DBG("AMPM_SMS_MSG:HEAP_FREE******************\r\n");
						}
						msg = msgTemp;
					}
				}
			}
			else
			{
					#ifdef CMSIS_OS_RTX
					osMutexRelease(ampmGsmSmsMutexId);
					#endif
					return 1;
			}
		#ifdef CMSIS_OS_RTX
			osMutexRelease(ampmGsmSmsMutexId);
		}
		#endif
	}
	return 0;
}
//Check SMS need to send out
uint8_t Ampm_SmsCheckMessage_IsEmpty(void)
{
	#ifdef CMSIS_OS_RTX
	if(osMutexWait(ampmGsmSmsMutexId, 1000) == osOK)
	#endif
	{
		if(list_length(smsList))
		{
			#ifdef CMSIS_OS_RTX
			osMutexRelease(ampmGsmSmsMutexId);
			#endif
			return 0;
		}
		#ifdef CMSIS_OS_RTX
		osMutexRelease(ampmGsmSmsMutexId);
		#endif
	}
	return 1;
}

uint8_t Ampm_SmsAddMsg(struct SMS_LIST_TYPE *msg)
{
	#ifdef CMSIS_OS_RTX
	if(osMutexWait(ampmGsmSmsMutexId, 1000) == osOK)
	{
		#endif
		AMPM_GSM_LIB_DBG("AMPM_SMS_MSG:ADD_TO_LIST->OK\r\n");
		list_add(smsList, msg);
		#ifdef CMSIS_OS_RTX
		osMutexRelease(ampmGsmSmsMutexId);
		#endif
		return SMS_OK;
	#ifdef CMSIS_OS_RTX
	}
	else
	{
		AMPM_GSM_LIB_DBG("AMPM_SMS_MSG:ADD_TO_LIST->FAIL\r\n");
		return SMS_ERROR;
	}
	#endif
}


uint8_t Ampm_Sms_SendMsg(uint8_t *status,void (*callback)(struct SMS_LIST_TYPE *msg),uint8_t *phone,uint8_t *msg,uint8_t len,SMS_MODE_TYPE mode,uint16_t timeout,uint8_t tryNum)
{
		struct SMS_LIST_TYPE *SMS = ampm_malloc(sizeof(struct SMS_LIST_TYPE));
		if(SMS == NULL)
			return SMS_ERROR;
		memset(SMS,0,sizeof(struct SMS_LIST_TYPE));
		if(mode != SMS_TEXT_MODE)
			SMS->msg = ampm_malloc(len);
		else
		{
			SMS->msg = ampm_malloc(len + 1);
			if(SMS->msg)
				SMS->msg[len] = '\0';
		}
		if(SMS->msg == NULL)
		{
			ampm_free(SMS);
			return SMS_ERROR;
		}
		SMS->status = status;
		if(status)
			*SMS->status = SMS_ERROR;
		memcpy(SMS->msg,msg,len);
		SMS->callback = callback;
		SMS->len = len;
		SMS->phone = phone;
		SMS->timeout = 0;
		SMS->timeoutReload = timeout;
		SMS->tryNum = tryNum;
		SMS->flag = SMS_NEW_MSG;
		if(mode != SMS_TEXT_MODE && (len == 0))
		{
				SMS->flag = SMS_MSG_SENT;
				ampm_free(SMS->msg);
				ampm_free(SMS);
				return SMS_ERROR;
		}
		if(SMS->phone[0] != NULL)
			SMS->flag = SMS_NEW_MSG;
		else
		{
			SMS->flag = SMS_MSG_SENT;
			ampm_free(SMS->msg);
			ampm_free(SMS);
			return SMS_ERROR;
		}
		SMS->mode = mode;
		return Ampm_SmsAddMsg(SMS);
}


/*+CMGR: "REC READ","+841645715282","","12/07/26,20:50:07+28"
"thienhailue"
*/

uint32_t Ampm_SMS_ReadMsg(uint16_t cnt,uint8_t c)
{ 
	static uint8_t comma = 0,getSmsDataFlag = 0;
	static uint8_t *u8pt;
	static uint8_t *u8pt1;
	static uint8_t *u8pt2;
	if(cnt == 0)
	{
		comma = 0;
		getSmsDataFlag = 0;
		u8pt = smsSender;
		u8pt2 = smsDataBuf;
		u8pt1 = (uint8_t *)terminateStr;
		return 0xff;
	}
	if(c == ',') 
	{
		comma++;
	}
	
	if(getSmsDataFlag)
	{
		if(c == *u8pt1)
		{
			u8pt1++;
			if(*u8pt1 == '\0')
			{
				if(u8pt2 - smsDataBuf > sizeof(terminateStr))
				{
					u8pt2 = u8pt2 - sizeof(terminateStr);
				}
				*u8pt2 = 0;
				flagSmsReadFinish = 1;
				return 0;
			}
		}
		else
		{
			u8pt1 = (uint8_t *)terminateStr;
			if(c == *u8pt1) u8pt1++;
		}
		if((u8pt2 - smsDataBuf) >= sizeof(smsDataBuf))
		{
			if(u8pt2 - smsDataBuf > sizeof(terminateStr))
			{
				u8pt2 = u8pt2 - sizeof(terminateStr);
			}
			*u8pt2 = 0;
			flagSmsReadFinish = 1;
			return 0;
		}
		*u8pt2 = c;
		 u8pt2++;
	}
	else
	{
		switch(comma)
		{
			case 0:
				break;
			case 1:
				if((u8pt - smsSender) >= sizeof(smsSender))
				{
					smsSender[0] = 0;
					return 0;
				}
				if(((c >= '0') && (c <= '9')) || (c == '+'))
				{
					*u8pt = c;
					u8pt++;
					*u8pt = 0;
				}
				break;
			default:
				break;
		}
	}
	if(c == '\n')
	{
		getSmsDataFlag = 1;
	}
	return 0xff;
}


