dvhai08/ampm_smartlight/firmware/VT_SMARTLIGHT_STM32F4_LWIP_V2/ampm_lib/ampm_gsm/ampm_gsm_sms.c
/*
+CSCA: "+886931000099",145
*/
uint32_t Ampm_GetServiceCenterNumber(uint16_t cnt,uint8_t c)
{
	static uint8_t len = 0;
	if(cnt == 0)
		len = 0;
	if((c >= '0') && (c <= '9') || (c == '+'))
	{
			if(c != '+')
			{
			 serviceCenterNumber[len] = c;
			 len++;
			 serviceCenterNumber[len] = '\0';
			}
	}
	else 
	{
		if(c == '"' && len >= 2)
		{
			getServiceCenterNumber = 1;
		}
		return 0;
	}
 return 0xff;
}

/*   14,"REC READ","+84972046096","","12/07/26,11:10:17+28"   */
/*
AT+CMGL="ALL"
+CMGL: 1,"REC READ","+84978779222",,"14/05/26,08:39:57+28"
*88:88#  
*/


/*+CMTI: "ME",1*/
uint32_t Ampm_SMS_URC_Incomming(uint16_t cnt,uint8_t c)
{ 
	static uint32_t length = 0;
	switch(cnt)
	{
		case 0:
				if((c >= '0') && (c <= '9'))
				{
					length = c - '0';
					break;
				}
				return 0;
		case 1:
		case 2:
		case 3:
				if((c >= '0') && (c <= '9'))
				{
					length *= 10;
					length += c - '0';
					break;
				}
				else
				{
					RINGBUF_Put(&smsUnreadRingBuff,(uint8_t)(length & 0x00ff));
					RINGBUF_Put(&smsUnreadRingBuff,(uint8_t)((length >> 8) & 0x00ff));
					return 0;
				}
		default:
			return 0;
	}
	return 0xff;
}



/*   14,"REC READ","+84972046096","","12/07/26,11:10:17+28"   */
/*
AT+CMGL="ALL"
+CMGL: 1,"REC READ","+84978779222",,"14/05/26,08:39:57+28"
*88:88#  
*/
uint32_t Ampm_SMS_Process(uint16_t cnt,uint8_t c)
{ 
	static uint32_t length = 0;
	switch(cnt)
	{
		case 0:
				Ampm_SetAtCmti();
				if((c >= '0') && (c <= '9'))
				{
					length = c - '0';
					break;
				}
				return 0;
		case 1:
		case 2:
		case 3:
				if((c >= '0') && (c <= '9'))
				{
					length *= 10;
					length += c - '0';
					break;
				}
				else
				{
					RINGBUF_Put(&smsUnreadRingBuff,(uint8_t)(length & 0x00ff));
					RINGBUF_Put(&smsUnreadRingBuff,(uint8_t)((length >> 8) & 0x00ff));
					return 0;
				}	
		default:
			return 0;
	}
	return 0xff;
}


uint8_t Ampm_SendSmsPolling(const uint8_t *recipient, const uint8_t *data)
{
	uint8_t buf[32];
	uint8_t i,c;
	SysTick_DelayMs(100);
	while(COMM_Getc(&c)==0);
	sprintf((char *)buf, "AT+CMGS=\"%s\"\r", recipient);
	COMM_Puts(buf);
	if(Ampm_AtCmdCheckResponse("> ", 10000))
	{
		return 0xff;
	}
	
	for(i = 0;i < 160;i++)
	{
		if(data[i] == '\0')
			break;
		//DbgCfgPutChar(data[i]);
		COMM_Putc(data[i]);
	}
	COMM_Putc(0x1A);
	
	if(Ampm_AtCmdCheckResponse("OK", 10000)){
		return 0xff;
	}
	return 0;
}




